#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      Studio Silk
#
# Created:     14.12.2020
# Copyright:   (c) Studio Silk 2020
# Licence:     <your licence>
#-------------------------------------------------------------------------------

#Задача «Минимальный делитель»
#Условие
#Дано целое число, не меньшее 2. Выведите его наименьший натуральный делитель,
#отличный от 1.
i = int(input())
n = 1
os = 1
while os != 0:
    n += 1
    os = i % n
print(n)