#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      Studio Silk
#
# Created:     14.12.2020
# Copyright:   (c) Studio Silk 2020
# Licence:     <your licence>
#-------------------------------------------------------------------------------
#Задача «Список квадратов»
#Условие
#По данному целому числу N распечатайте все квадраты натуральных чисел,
#не превосходящие N, в порядке возрастания.
i = int(input())
n = 1
n2 = 1
while n2 <= i:
    n2 = n**2
    if n2 > i:
        break
    print(n2)
    n = n + 1