#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      Studio Silk
#
# Created:     14.12.2020
# Copyright:   (c) Studio Silk 2020
# Licence:     <your licence>
#-------------------------------------------------------------------------------
#Задача «Степень двойки»
#Условие
#По данному натуральному числу N найдите наибольшую целую степень двойки,
#не превосходящую N. Выведите показатель степени и саму степень.

#Операцией возведения в степень пользоваться нельзя!

N = int(input())
A = 1
n = 2
s = 0
while A < N:
    A = A * n
    if A > N:
        A = A // 2
        break
    s += 1
print( s, A )