#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      Studio Silk
#
# Created:     13.12.2020
# Copyright:   (c) Studio Silk 2020
# Licence:     <your licence>
#-------------------------------------------------------------------------------
#Задача «Замена внутри фрагмента»
#Условие
#Дана строка. Замените в этой строке все появления буквы h на букву H,
#кроме первого и последнего вхождения.
s = input()
h1 = s.find('h')
h2 = s.rfind('h')
s2 = s[h1+1:h2]
s3 =s2.replace('h', 'H')
s4 = s[:h1+1] + s3 + s[h2:]
print(s4)
