#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      Studio Silk
#
# Created:     13.12.2020
# Copyright:   (c) Studio Silk 2020
# Licence:     <your licence>
#-------------------------------------------------------------------------------

#Задача «Замена подстроки»
#Условие
#Дана строка. Замените в этой строке все цифры 1 на слово one.

s = input()
s2 =s.replace('1', 'one')
print(s2)