#-------------------------------------------------------------------------------
# Name:        module2
# Purpose:
#
# Author:      Studio Silk
#
# Created:     12.12.2020
# Copyright:   (c) Studio Silk 2020
# Licence:     <your licence>
#-------------------------------------------------------------------------------
# Задача «Количество слов»
# Условие
# Дана строка, состоящая из слов, разделенных пробелами.
# Определите, сколько в ней слов. Используйте для решения задачи метод count.

s = input()
a = int(s.count(' '))
b = a + 1
print(b)