#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      Studio Silk
#
# Created:     13.12.2020
# Copyright:   (c) Studio Silk 2020
# Licence:     <your licence>
#-------------------------------------------------------------------------------
#Задача «Обращение фрагмента»
#Условие
#Дана строка, в которой буква h встречается как минимум два раза.
#Разверните последовательность символов, заключенную между первым и
#последним появлением буквы h, в противоположном порядке.

s1 = input()
h1 = s1.find('h')
h2 = s1.rfind('h')
s2 = s1[h1+1:h2]
s3 = s1[:h1+1] + s2[::-1] + s1[h2:]
print(s3)