#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      Studio Silk
#
# Created:     14.12.2020
# Copyright:   (c) Studio Silk 2020
# Licence:     <your licence>
#-------------------------------------------------------------------------------

#Задача «Удалить каждый третий символ»
#Условие
#Дана строка. Удалите из нее все символы, чьи индексы делятся на 3.

s = input()
k = int(len(s))
ss = ''
for i in range(k):
    if i % 3 != 0:
        ss = ss + s[i]
print(ss)