#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      Studio Silk
#
# Created:     13.12.2020
# Copyright:   (c) Studio Silk 2020
# Licence:     <your licence>
#-------------------------------------------------------------------------------

#Задача «Удаление фрагмента»
#Условие
#Дана строка, в которой буква h встречается минимум два раза.
#а также все символы, находящиеся между ними.

s1 = input()
h1 = s1.find('h')
h2 = s1.rfind('h')
s2 = s1[:h1] + s1[h2+1:]
print(s2)